zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC5500/periph1/PERI_SPI_FILTER.h
/*
** ###################################################################
**     Processors:          LPC5534JBD100
**                          LPC5534JBD64
**                          LPC5534JHI48
**                          LPC5536JBD100
**                          LPC5536JBD64
**                          LPC5536JHI48
**                          LPC55S36JBD100
**                          LPC55S36JHI48
**
**     Version:             rev. 2.0, 2024-10-29
**     Build:               b260515
**
**     Abstract:
**         CMSIS Peripheral Access Layer for SPI_FILTER
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2021-04-12)
**         Initial version based on RM DraftF
**     - rev. 1.1 (2021-08-04)
**         Initial version based on RM DraftG
**     - rev. 2.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_SPI_FILTER.h
 * @version 2.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for SPI_FILTER
 *
 * CMSIS Peripheral Access Layer for SPI_FILTER
 */

#if !defined(PERI_SPI_FILTER_H_)
#define PERI_SPI_FILTER_H_                       /**< Symbol preventing repeated inclusion */

#if (defined(CPU_LPC5534JBD100) || defined(CPU_LPC5534JBD64) || defined(CPU_LPC5534JHI48))
#include "LPC5534_COMMON.h"
#elif (defined(CPU_LPC5536JBD100) || defined(CPU_LPC5536JBD64) || defined(CPU_LPC5536JHI48))
#include "LPC5536_COMMON.h"
#elif (defined(CPU_LPC55S36JBD100) || defined(CPU_LPC55S36JHI48))
#include "LPC55S36_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- SPI_FILTER Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SPI_FILTER_Peripheral_Access_Layer SPI_FILTER Peripheral Access Layer
 * @{
 */

/** SPI_FILTER - Register Layout Typedef */
typedef struct {
  __IO uint32_t CR;                                /**< Control, offset: 0x0 */
  __I  uint32_t ISR;                               /**< Interrupt Register, offset: 0x4 */
  __IO uint32_t IMR;                               /**< Interrupt Mask Register, offset: 0x8 */
  __I  uint32_t SR;                                /**< Status Register, offset: 0xC */
  __IO uint32_t TCR;                               /**< Test Control Register, offset: 0x10 */
  __IO uint32_t P0FAR1;                            /**< Port 0 filter address region 1, offset: 0x14 */
  __IO uint32_t P0FAR2;                            /**< Port 0 filter address region 2, offset: 0x18 */
  __IO uint32_t P0FAR3;                            /**< Port 0 filter address region 3, offset: 0x1C */
  __IO uint32_t P1FAR1;                            /**< Port 1 filter address region 1, offset: 0x20 */
  __IO uint32_t P1FAR2;                            /**< Port 1 filter address region 2, offset: 0x24 */
  __IO uint32_t P1FAR3;                            /**< Port 1 filter address region 3, offset: 0x28 */
       uint8_t RESERVED_0[4];
  __I  uint32_t VER;                               /**< Version, offset: 0x30 */
       uint8_t RESERVED_1[12];
  __IO uint32_t POPCODE0;                          /**< Programmable OP-Code0, offset: 0x40 */
  __IO uint32_t POPCODE1;                          /**< Programmable OP-Code1, offset: 0x44 */
  __IO uint32_t POPCODE2;                          /**< Programmable OP-Code2, offset: 0x48 */
  __IO uint32_t POPCODE3;                          /**< Programmable OP-Code3, offset: 0x4C */
  __IO uint32_t POPCODE4;                          /**< Programmable OP-Code4, offset: 0x50 */
  __I  uint32_t P0BOC;                             /**< P0 Blocked Op Code, offset: 0x54 */
  __I  uint32_t P1BOC;                             /**< P1 Blocked Op Code, offset: 0x58 */
  __IO uint32_t P0MAM;                             /**< Port 0 Max Address Mask, offset: 0x5C */
  __IO uint32_t P1MAM;                             /**< Port 1 Max Address Mask, offset: 0x60 */
} SPI_FILTER_Type;

/* ----------------------------------------------------------------------------
   -- SPI_FILTER Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SPI_FILTER_Register_Masks SPI_FILTER Register Masks
 * @{
 */

/*! @name CR - Control */
/*! @{ */

#define SPI_FILTER_CR_P1_ACT_SEL_MASK            (0x10000U)
#define SPI_FILTER_CR_P1_ACT_SEL_SHIFT           (16U)
/*! P1_ACT_SEL - Active Chip Select for P1 filter
 *  0b0..Sets CS0 as the read location for the firmware image and sets CS1 as the write location for the FW image.
 *  0b1..Sets CS1 as the read location for the firmware image and sets CS0 as the write location for the FW image.
 */
#define SPI_FILTER_CR_P1_ACT_SEL(x)              (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P1_ACT_SEL_SHIFT)) & SPI_FILTER_CR_P1_ACT_SEL_MASK)

#define SPI_FILTER_CR_P1_BYTE_SEL_MASK           (0x20000U)
#define SPI_FILTER_CR_P1_BYTE_SEL_SHIFT          (17U)
/*! P1_BYTE_SEL - Address Byte Select Mode for P1
 *  0b0..Sets the filter to 4-byte address mode
 *  0b1..Sets the filter to 3-byte address mode
 */
#define SPI_FILTER_CR_P1_BYTE_SEL(x)             (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P1_BYTE_SEL_SHIFT)) & SPI_FILTER_CR_P1_BYTE_SEL_MASK)

#define SPI_FILTER_CR_P1_BYTE_SEL_MD_MASK        (0x40000U)
#define SPI_FILTER_CR_P1_BYTE_SEL_MD_SHIFT       (18U)
/*! P1_BYTE_SEL_MD - Address Byte Select Mode for P1
 *  0b0..Normal Operation. The Address byte mode is determined by the Op Code Command
 *  0b1..Sets the Byte Mode to 3-byte and gives control of the function to the P1_BYTE_SEL in the P1 Filter
 *       Control Register. In this mode, any changes to P1_BYTE_SEL are latched and the internal state of P1_BYTE_SEL
 *       will retain this value when P1_BYTE_SEL_MD is cleared
 */
#define SPI_FILTER_CR_P1_BYTE_SEL_MD(x)          (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P1_BYTE_SEL_MD_SHIFT)) & SPI_FILTER_CR_P1_BYTE_SEL_MD_MASK)

#define SPI_FILTER_CR_P1_DIRTY_CLR_MASK          (0x80000U)
#define SPI_FILTER_CR_P1_DIRTY_CLR_SHIFT         (19U)
/*! P1_DIRTY_CLR - Clear dirty state for P1 */
#define SPI_FILTER_CR_P1_DIRTY_CLR(x)            (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P1_DIRTY_CLR_SHIFT)) & SPI_FILTER_CR_P1_DIRTY_CLR_MASK)

