zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC5500/periph1/PERI_SPI_FILTER.h
#define SPI_FILTER_CR_P1_FLT_EN_MASK             (0x100000U)
#define SPI_FILTER_CR_P1_FLT_EN_SHIFT            (20U)
/*! P1_FLT_EN - Filter Enable bit for P1 filter
 *  0b0..Filter Disabled. All CS Disable outputs are asserted so that host access to the flash devices is
 *       disabled. CS# inputs to the filter are disabled so that the filter state machine is locked in its current state.
 *       All register controls remain functional.
 *  0b1..Filter Enabled. CS# inputs to the filter are enabled and the filter state machine controls the CS disable
 *       outputs. This bit takes priority over the P1_BYP_EN bit in the Test Control Register. Setting this bit
 *       will enable filtering and will enable communication to flash devices regardless of the state of P1_BYP_EN.
 *       All other register controls remain functional while filtering is enabled.
 */
#define SPI_FILTER_CR_P1_FLT_EN(x)               (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P1_FLT_EN_SHIFT)) & SPI_FILTER_CR_P1_FLT_EN_MASK)

#define SPI_FILTER_CR_P1_FLASH_MD_MASK           (0x200000U)
#define SPI_FILTER_CR_P1_FLASH_MD_SHIFT          (21U)
/*! P1_FLASH_MD - Flash Mode Select for P1
 *  0b0..Dual Flash Mode. Supports two separate physical flash devices as described in Section 3.1
 *  0b1..Single Flash Mode. Supports a single physical flash device as described in Section 3.2. Note that all
 *       Chip Erase Op Codes are blocked when in this mode.
 */
#define SPI_FILTER_CR_P1_FLASH_MD(x)             (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P1_FLASH_MD_SHIFT)) & SPI_FILTER_CR_P1_FLASH_MD_MASK)

#define SPI_FILTER_CR_P0_ACT_SEL_MASK            (0x1000000U)
#define SPI_FILTER_CR_P0_ACT_SEL_SHIFT           (24U)
/*! P0_ACT_SEL - Active Chip Select for P0 filter
 *  0b0..Sets CS0 as the read location for the firmware image and sets CS1 as the write location for the FW image.
 *  0b1..Sets CS1 as the read location for the firmware image and sets CS0 as the write location for the FW image.
 */
#define SPI_FILTER_CR_P0_ACT_SEL(x)              (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P0_ACT_SEL_SHIFT)) & SPI_FILTER_CR_P0_ACT_SEL_MASK)

#define SPI_FILTER_CR_P0_BYTE_SEL_MASK           (0x2000000U)
#define SPI_FILTER_CR_P0_BYTE_SEL_SHIFT          (25U)
/*! P0_BYTE_SEL - Address Byte Select for P0 filter
 *  0b0..Sets the filter to 3-byte address mode
 *  0b1..Sets the filter to 4-byte address mode
 */
#define SPI_FILTER_CR_P0_BYTE_SEL(x)             (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P0_BYTE_SEL_SHIFT)) & SPI_FILTER_CR_P0_BYTE_SEL_MASK)

#define SPI_FILTER_CR_P0_BYTE_SEL_MD_MASK        (0x4000000U)
#define SPI_FILTER_CR_P0_BYTE_SEL_MD_SHIFT       (26U)
/*! P0_BYTE_SEL_MD - Address Byte Select Mode for P0 filter
 *  0b0..Normal Operation. The Address byte mode is determined by the Op Code Command
 *  0b1..Sets the Byte Mode to 3-byte and gives control of the function to the P0_BYTE_SEL in the P0 Filter
 *       Control Register. In this mode, any changes to P0_BYTE_SEL are latched and the internal state of BYTE_SEL will
 *       retain this value when P0_BYTE_SEL_MD is cleared.
 */
#define SPI_FILTER_CR_P0_BYTE_SEL_MD(x)          (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P0_BYTE_SEL_MD_SHIFT)) & SPI_FILTER_CR_P0_BYTE_SEL_MD_MASK)

#define SPI_FILTER_CR_P0_DIRTY_CLR_MASK          (0x8000000U)
#define SPI_FILTER_CR_P0_DIRTY_CLR_SHIFT         (27U)
/*! P0_DIRTY_CLR - Clear dirty state for P0 */
#define SPI_FILTER_CR_P0_DIRTY_CLR(x)            (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P0_DIRTY_CLR_SHIFT)) & SPI_FILTER_CR_P0_DIRTY_CLR_MASK)

#define SPI_FILTER_CR_P0_FLT_EN_MASK             (0x10000000U)
#define SPI_FILTER_CR_P0_FLT_EN_SHIFT            (28U)
/*! P0_FLT_EN - Filter Enable bit for P0
 *  0b0..Filter Enabled. CS# inputs to the filter are enabled and the filter state machine controls the CS disable
 *       outputs. CS# inputs to the filter are enabled so that the filter state machine is active. All other
 *       register controls are functional.
 *  0b1..Filter Disabled. All CS Disable outputs are asserted so that host access to the flash devices is
 *       disabled. CS# inputs to the filter are disabled so that the filter state machine is locked in its current state.
 *       All other register controls can be accessed, but have no impact on the functionality of the filter while
 *       the filter is disabled.
 */
#define SPI_FILTER_CR_P0_FLT_EN(x)               (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P0_FLT_EN_SHIFT)) & SPI_FILTER_CR_P0_FLT_EN_MASK)

#define SPI_FILTER_CR_P0_FLASH_MD_MASK           (0x20000000U)
#define SPI_FILTER_CR_P0_FLASH_MD_SHIFT          (29U)
/*! P0_FLASH_MD - Flash Mode Select for P0
 *  0b0..Dual Flash Mode. Supports two separate physical flash devices as described in Section 3.1
 *  0b1..Single Flash Mode. Supports a single physical flash device as described in Section 3.2. Note that all
 *       Chip Erase Op Codes are blocked when in this mode.
 */
#define SPI_FILTER_CR_P0_FLASH_MD(x)             (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_CR_P0_FLASH_MD_SHIFT)) & SPI_FILTER_CR_P0_FLASH_MD_MASK)
/*! @} */

/*! @name ISR - Interrupt Register */
/*! @{ */

#define SPI_FILTER_ISR_P0_DIRTY_INT_MASK         (0x1000000U)
#define SPI_FILTER_ISR_P0_DIRTY_INT_SHIFT        (24U)
/*! P0_DIRTY_INT
 *  0b0..Indicates normal operation
 *  0b1..Indicates that a write has occurred to the FW Code region of the inactive Flash and that flash is now considered corrupt
 */
#define SPI_FILTER_ISR_P0_DIRTY_INT(x)           (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_ISR_P0_DIRTY_INT_SHIFT)) & SPI_FILTER_ISR_P0_DIRTY_INT_MASK)

#define SPI_FILTER_ISR_P1_DIRTY_INT_MASK         (0x2000000U)
#define SPI_FILTER_ISR_P1_DIRTY_INT_SHIFT        (25U)
/*! P1_DIRTY_INT
 *  0b0..Indicates normal operation
 *  0b1..Indicates that a write has occurred to the FW Code region of the inactive Flash and that flash is now considered corrupt
 */
#define SPI_FILTER_ISR_P1_DIRTY_INT(x)           (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_ISR_P1_DIRTY_INT_SHIFT)) & SPI_FILTER_ISR_P1_DIRTY_INT_MASK)

#define SPI_FILTER_ISR_P0_BLK_INT_MASK           (0x4000000U)
#define SPI_FILTER_ISR_P0_BLK_INT_SHIFT          (26U)
/*! P0_BLK_INT
 *  0b0..Indicates normal operation
 *  0b1..Indicates that a blocked opcode has been detected
 */
#define SPI_FILTER_ISR_P0_BLK_INT(x)             (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_ISR_P0_BLK_INT_SHIFT)) & SPI_FILTER_ISR_P0_BLK_INT_MASK)

