zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC5500/periph1/PERI_SPI_FILTER.h
#define SPI_FILTER_ISR_P1_BLK_INT_MASK           (0x8000000U)
#define SPI_FILTER_ISR_P1_BLK_INT_SHIFT          (27U)
/*! P1_BLK_INT
 *  0b0..Indicates normal operation
 *  0b1..Indicates that a blocked opcode has been detected
 */
#define SPI_FILTER_ISR_P1_BLK_INT(x)             (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_ISR_P1_BLK_INT_SHIFT)) & SPI_FILTER_ISR_P1_BLK_INT_MASK)

#define SPI_FILTER_ISR_P0_BYTEMODE_INT_MASK      (0x10000000U)
#define SPI_FILTER_ISR_P0_BYTEMODE_INT_SHIFT     (28U)
/*! P0_BYTEMODE_INT
 *  0b0..Indicates normal operation
 *  0b1..Indicates that a Bytemode change has been detected (OpCode E9 or B7)
 */
#define SPI_FILTER_ISR_P0_BYTEMODE_INT(x)        (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_ISR_P0_BYTEMODE_INT_SHIFT)) & SPI_FILTER_ISR_P0_BYTEMODE_INT_MASK)

#define SPI_FILTER_ISR_P1_BYTEMODE_INT_MASK      (0x20000000U)
#define SPI_FILTER_ISR_P1_BYTEMODE_INT_SHIFT     (29U)
/*! P1_BYTEMODE_INT
 *  0b0..Indicates normal operation
 *  0b1..Indicates that a Bytemode change has been detected (OpCode E9 or B7)
 */
#define SPI_FILTER_ISR_P1_BYTEMODE_INT(x)        (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_ISR_P1_BYTEMODE_INT_SHIFT)) & SPI_FILTER_ISR_P1_BYTEMODE_INT_MASK)

#define SPI_FILTER_ISR_P0_F8_INT_MASK            (0x40000000U)
#define SPI_FILTER_ISR_P0_F8_INT_SHIFT           (30U)
/*! P0_F8_INT
 *  0b0..Indicates normal operation
 *  0b1..Indicates an F8 command has been detected
 */
#define SPI_FILTER_ISR_P0_F8_INT(x)              (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_ISR_P0_F8_INT_SHIFT)) & SPI_FILTER_ISR_P0_F8_INT_MASK)

#define SPI_FILTER_ISR_P1_F8_INT_MASK            (0x80000000U)
#define SPI_FILTER_ISR_P1_F8_INT_SHIFT           (31U)
/*! P1_F8_INT
 *  0b0..Indicates normal operation
 *  0b1..Indicates an F8 command has been detected
 */
#define SPI_FILTER_ISR_P1_F8_INT(x)              (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_ISR_P1_F8_INT_SHIFT)) & SPI_FILTER_ISR_P1_F8_INT_MASK)
/*! @} */

/*! @name IMR - Interrupt Mask Register */
/*! @{ */

#define SPI_FILTER_IMR_P0_DIRTY_MASK_MASK        (0x1000000U)
#define SPI_FILTER_IMR_P0_DIRTY_MASK_SHIFT       (24U)
/*! P0_DIRTY_MASK - Mask bit for P0_DIRTY_INT
 *  0b0..Indicates P0_DIRTY_INT interrupt is disabled.
 *  0b1..Indicates P0_DIRTY_INT interrupt is enabled.
 */
#define SPI_FILTER_IMR_P0_DIRTY_MASK(x)          (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_IMR_P0_DIRTY_MASK_SHIFT)) & SPI_FILTER_IMR_P0_DIRTY_MASK_MASK)

#define SPI_FILTER_IMR_P1_DIRTY_MASK_MASK        (0x2000000U)
#define SPI_FILTER_IMR_P1_DIRTY_MASK_SHIFT       (25U)
/*! P1_DIRTY_MASK - Mask bit for P1_DIRTY_INT
 *  0b0..Indicates normal operation. P1_DIRTY_INT interrupt is enabled.
 *  0b1..Indicates P1_DIRTY_INT interrupt is disabled.
 */
#define SPI_FILTER_IMR_P1_DIRTY_MASK(x)          (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_IMR_P1_DIRTY_MASK_SHIFT)) & SPI_FILTER_IMR_P1_DIRTY_MASK_MASK)

#define SPI_FILTER_IMR_P0_BLK_MASK_MASK          (0x4000000U)
#define SPI_FILTER_IMR_P0_BLK_MASK_SHIFT         (26U)
/*! P0_BLK_MASK - Mask bit for P0_BLK_MASK
 *  0b0..Indicates P0_BLK_MASK is enabled.
 *  0b1..Indicates P0_BLK_MASK is disabled.
 */
#define SPI_FILTER_IMR_P0_BLK_MASK(x)            (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_IMR_P0_BLK_MASK_SHIFT)) & SPI_FILTER_IMR_P0_BLK_MASK_MASK)

#define SPI_FILTER_IMR_P1_BLK_MASK_MASK          (0x8000000U)
#define SPI_FILTER_IMR_P1_BLK_MASK_SHIFT         (27U)
/*! P1_BLK_MASK - Mask bit for P1_BLK_MASK
 *  0b0..Indicates P1_BLK_MASK is enabled.
 *  0b1..Indicates P1_BLK_MASK is disabled.
 */
#define SPI_FILTER_IMR_P1_BLK_MASK(x)            (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_IMR_P1_BLK_MASK_SHIFT)) & SPI_FILTER_IMR_P1_BLK_MASK_MASK)

#define SPI_FILTER_IMR_P0_BYTEMODE_MASK_MASK     (0x10000000U)
#define SPI_FILTER_IMR_P0_BYTEMODE_MASK_SHIFT    (28U)
/*! P0_BYTEMODE_MASK - Mask bit for P0_BYTEMODE_MASK
 *  0b0..Indicates P0_BYTEMODE_MASK is enabled.
 *  0b1..Indicates P0_BYTEMODE_MASK is disabled.
 */
#define SPI_FILTER_IMR_P0_BYTEMODE_MASK(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_IMR_P0_BYTEMODE_MASK_SHIFT)) & SPI_FILTER_IMR_P0_BYTEMODE_MASK_MASK)

#define SPI_FILTER_IMR_P1_BYTEMODE_MASK_MASK     (0x20000000U)
#define SPI_FILTER_IMR_P1_BYTEMODE_MASK_SHIFT    (29U)
/*! P1_BYTEMODE_MASK - Mask bit for P1_BYTEMODE_MASK
 *  0b0..Indicates P1_BYTEMODE_MASK is enabled.
 *  0b1..Indicates P1_BYTEMODE_MASK is disabled.
 */
#define SPI_FILTER_IMR_P1_BYTEMODE_MASK(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_IMR_P1_BYTEMODE_MASK_SHIFT)) & SPI_FILTER_IMR_P1_BYTEMODE_MASK_MASK)

#define SPI_FILTER_IMR_P0_F8_MASK_MASK           (0x40000000U)
#define SPI_FILTER_IMR_P0_F8_MASK_SHIFT          (30U)
/*! P0_F8_MASK - Mask bit for P0_F8_MASK
 *  0b0..Indicates P0_F8_MASK is enabled.
 *  0b1..Indicates P0_F8_MASK is disabled.
 */
#define SPI_FILTER_IMR_P0_F8_MASK(x)             (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_IMR_P0_F8_MASK_SHIFT)) & SPI_FILTER_IMR_P0_F8_MASK_MASK)

#define SPI_FILTER_IMR_P1_F8_MASK_MASK           (0x80000000U)
#define SPI_FILTER_IMR_P1_F8_MASK_SHIFT          (31U)
/*! P1_F8_MASK - Mask bit for P1_F8_MASK
 *  0b0..Indicates P1_F8_MASK is enabled.
 *  0b1..Indicates P1_F8_MASK is disabled.
 */
#define SPI_FILTER_IMR_P1_F8_MASK(x)             (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_IMR_P1_F8_MASK_SHIFT)) & SPI_FILTER_IMR_P1_F8_MASK_MASK)
/*! @} */

/*! @name SR - Status Register */
/*! @{ */

#define SPI_FILTER_SR_P1_DIRTY_MASK              (0x10000U)
#define SPI_FILTER_SR_P1_DIRTY_SHIFT             (16U)
/*! P1_DIRTY
 *  0b0..Indicates normal operation. No Writes have been directed to the inactive Flash
 *  0b1..Indicates that a write to the inactive Flash has been detected and the state of the flash should be considered "dirty".
 */
#define SPI_FILTER_SR_P1_DIRTY(x)                (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_SR_P1_DIRTY_SHIFT)) & SPI_FILTER_SR_P1_DIRTY_MASK)

#define SPI_FILTER_SR_P1_BYTE_MODE_MASK          (0x20000U)
#define SPI_FILTER_SR_P1_BYTE_MODE_SHIFT         (17U)
/*! P1_BYTE_MODE
 *  0b0..3-Byte Address Mode
 *  0b1..4-Byte Address Mode
 */
#define SPI_FILTER_SR_P1_BYTE_MODE(x)            (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_SR_P1_BYTE_MODE_SHIFT)) & SPI_FILTER_SR_P1_BYTE_MODE_MASK)

#define SPI_FILTER_SR_P0_DIRTY_MASK              (0x1000000U)
#define SPI_FILTER_SR_P0_DIRTY_SHIFT             (24U)
/*! P0_DIRTY
 *  0b0..Indicates normal operation. No Writes have been directed to the inactive Flash
 *  0b1..Indicates that a write to the inactive Flash has been detected and the state of the flash should be considered "dirty".
 */
#define SPI_FILTER_SR_P0_DIRTY(x)                (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_SR_P0_DIRTY_SHIFT)) & SPI_FILTER_SR_P0_DIRTY_MASK)

#define SPI_FILTER_SR_P0_BYTE_MODE_MASK          (0x2000000U)
#define SPI_FILTER_SR_P0_BYTE_MODE_SHIFT         (25U)
/*! P0_BYTE_MODE
 *  0b0..3-Byte Address Mode
 *  0b1..4-Byte Address Mode
 */
#define SPI_FILTER_SR_P0_BYTE_MODE(x)            (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_SR_P0_BYTE_MODE_SHIFT)) & SPI_FILTER_SR_P0_BYTE_MODE_MASK)
/*! @} */

/*! @name TCR - Test Control Register */
/*! @{ */

#define SPI_FILTER_TCR_P0_BYP_SEL_MASK           (0x10000U)
#define SPI_FILTER_TCR_P0_BYP_SEL_SHIFT          (16U)
/*! P0_BYP_SEL
 *  0b0..CS0
 *  0b1..CS1
 */
#define SPI_FILTER_TCR_P0_BYP_SEL(x)             (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_TCR_P0_BYP_SEL_SHIFT)) & SPI_FILTER_TCR_P0_BYP_SEL_MASK)

#define SPI_FILTER_TCR_P0_BYP_EN_MASK            (0x20000U)
#define SPI_FILTER_TCR_P0_BYP_EN_SHIFT           (17U)
/*! P0_BYP_EN
 *  0b0..Filter Bypass Disabled
 *  0b1..Filter Bypass Enabled
 */
#define SPI_FILTER_TCR_P0_BYP_EN(x)              (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_TCR_P0_BYP_EN_SHIFT)) & SPI_FILTER_TCR_P0_BYP_EN_MASK)

#define SPI_FILTER_TCR_P1_BYP_SEL_MASK           (0x40000U)
#define SPI_FILTER_TCR_P1_BYP_SEL_SHIFT          (18U)
/*! P1_BYP_SEL
 *  0b0..CS0
 *  0b1..CS1
 */
#define SPI_FILTER_TCR_P1_BYP_SEL(x)             (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_TCR_P1_BYP_SEL_SHIFT)) & SPI_FILTER_TCR_P1_BYP_SEL_MASK)

#define SPI_FILTER_TCR_P1_BYP_EN_MASK            (0x80000U)
#define SPI_FILTER_TCR_P1_BYP_EN_SHIFT           (19U)
/*! P1_BYP_EN
 *  0b0..Filter Bypass Disabled
 *  0b1..Filter Bypass Enabled
 */
#define SPI_FILTER_TCR_P1_BYP_EN(x)              (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_TCR_P1_BYP_EN_SHIFT)) & SPI_FILTER_TCR_P1_BYP_EN_MASK)

#define SPI_FILTER_TCR_P0_MFG_ID_MASK            (0xF000000U)
#define SPI_FILTER_TCR_P0_MFG_ID_SHIFT           (24U)
/*! P0_MFG_ID - Sets the Flash memory manufacturer
 *  0b0000..Macronix
 *  0b0001..Windbond
 *  0b0010..Micron
 */
#define SPI_FILTER_TCR_P0_MFG_ID(x)              (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_TCR_P0_MFG_ID_SHIFT)) & SPI_FILTER_TCR_P0_MFG_ID_MASK)

