zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC5500/periph1/PERI_SPI_FILTER.h
#define SPI_FILTER_TCR_P1_MFG_ID_MASK            (0xF0000000U)
#define SPI_FILTER_TCR_P1_MFG_ID_SHIFT           (28U)
/*! P1_MFG_ID - Sets the Flash memory manufacturer
 *  0b0000..Macronix
 *  0b0001..Windbond
 *  0b0010..Micron
 */
#define SPI_FILTER_TCR_P1_MFG_ID(x)              (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_TCR_P1_MFG_ID_SHIFT)) & SPI_FILTER_TCR_P1_MFG_ID_MASK)
/*! @} */

/*! @name P0FAR1 - Port 0 filter address region 1 */
/*! @{ */

#define SPI_FILTER_P0FAR1_ADDRESS_LOWER_LSBS_MASK (0xFFU)
#define SPI_FILTER_P0FAR1_ADDRESS_LOWER_LSBS_SHIFT (0U)
/*! ADDRESS_LOWER_LSBS - Address Lower LSBs */
#define SPI_FILTER_P0FAR1_ADDRESS_LOWER_LSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0FAR1_ADDRESS_LOWER_LSBS_SHIFT)) & SPI_FILTER_P0FAR1_ADDRESS_LOWER_LSBS_MASK)

#define SPI_FILTER_P0FAR1_ADDRESS_LOWER_MSBS_MASK (0xFF00U)
#define SPI_FILTER_P0FAR1_ADDRESS_LOWER_MSBS_SHIFT (8U)
/*! ADDRESS_LOWER_MSBS - Address Lower MSBs */
#define SPI_FILTER_P0FAR1_ADDRESS_LOWER_MSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0FAR1_ADDRESS_LOWER_MSBS_SHIFT)) & SPI_FILTER_P0FAR1_ADDRESS_LOWER_MSBS_MASK)

#define SPI_FILTER_P0FAR1_ADDRESS_UPPER_LSBS_MASK (0xFF0000U)
#define SPI_FILTER_P0FAR1_ADDRESS_UPPER_LSBS_SHIFT (16U)
/*! ADDRESS_UPPER_LSBS - Address Upper LSBs */
#define SPI_FILTER_P0FAR1_ADDRESS_UPPER_LSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0FAR1_ADDRESS_UPPER_LSBS_SHIFT)) & SPI_FILTER_P0FAR1_ADDRESS_UPPER_LSBS_MASK)

#define SPI_FILTER_P0FAR1_ADDRESS_UPPER_MSBS_MASK (0xFF000000U)
#define SPI_FILTER_P0FAR1_ADDRESS_UPPER_MSBS_SHIFT (24U)
/*! ADDRESS_UPPER_MSBS - Address Upper MSBs */
#define SPI_FILTER_P0FAR1_ADDRESS_UPPER_MSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0FAR1_ADDRESS_UPPER_MSBS_SHIFT)) & SPI_FILTER_P0FAR1_ADDRESS_UPPER_MSBS_MASK)
/*! @} */

/*! @name P0FAR2 - Port 0 filter address region 2 */
/*! @{ */

#define SPI_FILTER_P0FAR2_ADDRESS_LOWER_LSBS_MASK (0xFFU)
#define SPI_FILTER_P0FAR2_ADDRESS_LOWER_LSBS_SHIFT (0U)
/*! ADDRESS_LOWER_LSBS - Address Lower LSBs */
#define SPI_FILTER_P0FAR2_ADDRESS_LOWER_LSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0FAR2_ADDRESS_LOWER_LSBS_SHIFT)) & SPI_FILTER_P0FAR2_ADDRESS_LOWER_LSBS_MASK)

#define SPI_FILTER_P0FAR2_ADDRESS_LOWER_MSBS_MASK (0xFF00U)
#define SPI_FILTER_P0FAR2_ADDRESS_LOWER_MSBS_SHIFT (8U)
/*! ADDRESS_LOWER_MSBS - Address Lower MSBs */
#define SPI_FILTER_P0FAR2_ADDRESS_LOWER_MSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0FAR2_ADDRESS_LOWER_MSBS_SHIFT)) & SPI_FILTER_P0FAR2_ADDRESS_LOWER_MSBS_MASK)

#define SPI_FILTER_P0FAR2_ADDRESS_UPPER_LSBS_MASK (0xFF0000U)
#define SPI_FILTER_P0FAR2_ADDRESS_UPPER_LSBS_SHIFT (16U)
/*! ADDRESS_UPPER_LSBS - Address Upper LSBs */
#define SPI_FILTER_P0FAR2_ADDRESS_UPPER_LSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0FAR2_ADDRESS_UPPER_LSBS_SHIFT)) & SPI_FILTER_P0FAR2_ADDRESS_UPPER_LSBS_MASK)

#define SPI_FILTER_P0FAR2_ADDRESS_UPPER_MSBS_MASK (0xFF000000U)
#define SPI_FILTER_P0FAR2_ADDRESS_UPPER_MSBS_SHIFT (24U)
/*! ADDRESS_UPPER_MSBS - Address Upper MSBs */
#define SPI_FILTER_P0FAR2_ADDRESS_UPPER_MSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0FAR2_ADDRESS_UPPER_MSBS_SHIFT)) & SPI_FILTER_P0FAR2_ADDRESS_UPPER_MSBS_MASK)
/*! @} */

/*! @name P0FAR3 - Port 0 filter address region 3 */
/*! @{ */

#define SPI_FILTER_P0FAR3_ADDRESS_LOWER_LSBS_MASK (0xFFU)
#define SPI_FILTER_P0FAR3_ADDRESS_LOWER_LSBS_SHIFT (0U)
/*! ADDRESS_LOWER_LSBS - Address Lower LSBs */
#define SPI_FILTER_P0FAR3_ADDRESS_LOWER_LSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0FAR3_ADDRESS_LOWER_LSBS_SHIFT)) & SPI_FILTER_P0FAR3_ADDRESS_LOWER_LSBS_MASK)

#define SPI_FILTER_P0FAR3_ADDRESS_LOWER_MSBS_MASK (0xFF00U)
#define SPI_FILTER_P0FAR3_ADDRESS_LOWER_MSBS_SHIFT (8U)
/*! ADDRESS_LOWER_MSBS - Address Lower MSBs */
#define SPI_FILTER_P0FAR3_ADDRESS_LOWER_MSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0FAR3_ADDRESS_LOWER_MSBS_SHIFT)) & SPI_FILTER_P0FAR3_ADDRESS_LOWER_MSBS_MASK)

#define SPI_FILTER_P0FAR3_ADDRESS_UPPER_LSBS_MASK (0xFF0000U)
#define SPI_FILTER_P0FAR3_ADDRESS_UPPER_LSBS_SHIFT (16U)
/*! ADDRESS_UPPER_LSBS - Address Upper LSBs */
#define SPI_FILTER_P0FAR3_ADDRESS_UPPER_LSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0FAR3_ADDRESS_UPPER_LSBS_SHIFT)) & SPI_FILTER_P0FAR3_ADDRESS_UPPER_LSBS_MASK)

#define SPI_FILTER_P0FAR3_ADDRESS_UPPER_MSBS_MASK (0xFF000000U)
#define SPI_FILTER_P0FAR3_ADDRESS_UPPER_MSBS_SHIFT (24U)
/*! ADDRESS_UPPER_MSBS - Address Upper MSBs */
#define SPI_FILTER_P0FAR3_ADDRESS_UPPER_MSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P0FAR3_ADDRESS_UPPER_MSBS_SHIFT)) & SPI_FILTER_P0FAR3_ADDRESS_UPPER_MSBS_MASK)
/*! @} */

/*! @name P1FAR1 - Port 1 filter address region 1 */
/*! @{ */

#define SPI_FILTER_P1FAR1_ADDRESS_LOWER_LSBS_MASK (0xFFU)
#define SPI_FILTER_P1FAR1_ADDRESS_LOWER_LSBS_SHIFT (0U)
/*! ADDRESS_LOWER_LSBS - Address Lower LSBs */
#define SPI_FILTER_P1FAR1_ADDRESS_LOWER_LSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P1FAR1_ADDRESS_LOWER_LSBS_SHIFT)) & SPI_FILTER_P1FAR1_ADDRESS_LOWER_LSBS_MASK)

#define SPI_FILTER_P1FAR1_ADDRESS_LOWER_MSBS_MASK (0xFF00U)
#define SPI_FILTER_P1FAR1_ADDRESS_LOWER_MSBS_SHIFT (8U)
/*! ADDRESS_LOWER_MSBS - Address Lower MSBs */
#define SPI_FILTER_P1FAR1_ADDRESS_LOWER_MSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P1FAR1_ADDRESS_LOWER_MSBS_SHIFT)) & SPI_FILTER_P1FAR1_ADDRESS_LOWER_MSBS_MASK)

#define SPI_FILTER_P1FAR1_ADDRESS_UPPER_LSBS_MASK (0xFF0000U)
#define SPI_FILTER_P1FAR1_ADDRESS_UPPER_LSBS_SHIFT (16U)
/*! ADDRESS_UPPER_LSBS - Address Upper LSBs */
#define SPI_FILTER_P1FAR1_ADDRESS_UPPER_LSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P1FAR1_ADDRESS_UPPER_LSBS_SHIFT)) & SPI_FILTER_P1FAR1_ADDRESS_UPPER_LSBS_MASK)

#define SPI_FILTER_P1FAR1_ADDRESS_UPPER_MSBS_MASK (0xFF000000U)
#define SPI_FILTER_P1FAR1_ADDRESS_UPPER_MSBS_SHIFT (24U)
/*! ADDRESS_UPPER_MSBS - Address Upper MSBs */
#define SPI_FILTER_P1FAR1_ADDRESS_UPPER_MSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P1FAR1_ADDRESS_UPPER_MSBS_SHIFT)) & SPI_FILTER_P1FAR1_ADDRESS_UPPER_MSBS_MASK)
/*! @} */

/*! @name P1FAR2 - Port 1 filter address region 2 */
/*! @{ */

