zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC5500/periph1/PERI_SPI_FILTER.h
#define SPI_FILTER_P1FAR2_ADDRESS_LOWER_LSBS_MASK (0xFFU)
#define SPI_FILTER_P1FAR2_ADDRESS_LOWER_LSBS_SHIFT (0U)
/*! ADDRESS_LOWER_LSBS - Address Lower LSBs */
#define SPI_FILTER_P1FAR2_ADDRESS_LOWER_LSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P1FAR2_ADDRESS_LOWER_LSBS_SHIFT)) & SPI_FILTER_P1FAR2_ADDRESS_LOWER_LSBS_MASK)

#define SPI_FILTER_P1FAR2_ADDRESS_LOWER_MSBS_MASK (0xFF00U)
#define SPI_FILTER_P1FAR2_ADDRESS_LOWER_MSBS_SHIFT (8U)
/*! ADDRESS_LOWER_MSBS - Address Lower MSBs */
#define SPI_FILTER_P1FAR2_ADDRESS_LOWER_MSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P1FAR2_ADDRESS_LOWER_MSBS_SHIFT)) & SPI_FILTER_P1FAR2_ADDRESS_LOWER_MSBS_MASK)

#define SPI_FILTER_P1FAR2_ADDRESS_UPPER_LSBS_MASK (0xFF0000U)
#define SPI_FILTER_P1FAR2_ADDRESS_UPPER_LSBS_SHIFT (16U)
/*! ADDRESS_UPPER_LSBS - Address Upper LSBs */
#define SPI_FILTER_P1FAR2_ADDRESS_UPPER_LSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P1FAR2_ADDRESS_UPPER_LSBS_SHIFT)) & SPI_FILTER_P1FAR2_ADDRESS_UPPER_LSBS_MASK)

#define SPI_FILTER_P1FAR2_ADDRESS_UPPER_MSBS_MASK (0xFF000000U)
#define SPI_FILTER_P1FAR2_ADDRESS_UPPER_MSBS_SHIFT (24U)
/*! ADDRESS_UPPER_MSBS - Address Upper MSBs */
#define SPI_FILTER_P1FAR2_ADDRESS_UPPER_MSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P1FAR2_ADDRESS_UPPER_MSBS_SHIFT)) & SPI_FILTER_P1FAR2_ADDRESS_UPPER_MSBS_MASK)
/*! @} */

/*! @name P1FAR3 - Port 1 filter address region 3 */
/*! @{ */

#define SPI_FILTER_P1FAR3_ADDRESS_LOWER_LSBS_MASK (0xFFU)
#define SPI_FILTER_P1FAR3_ADDRESS_LOWER_LSBS_SHIFT (0U)
/*! ADDRESS_LOWER_LSBS - Address Lower LSBs */
#define SPI_FILTER_P1FAR3_ADDRESS_LOWER_LSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P1FAR3_ADDRESS_LOWER_LSBS_SHIFT)) & SPI_FILTER_P1FAR3_ADDRESS_LOWER_LSBS_MASK)

#define SPI_FILTER_P1FAR3_ADDRESS_LOWER_MSBS_MASK (0xFF00U)
#define SPI_FILTER_P1FAR3_ADDRESS_LOWER_MSBS_SHIFT (8U)
/*! ADDRESS_LOWER_MSBS - Address Lower MSBs */
#define SPI_FILTER_P1FAR3_ADDRESS_LOWER_MSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P1FAR3_ADDRESS_LOWER_MSBS_SHIFT)) & SPI_FILTER_P1FAR3_ADDRESS_LOWER_MSBS_MASK)

#define SPI_FILTER_P1FAR3_ADDRESS_UPPER_LSBS_MASK (0xFF0000U)
#define SPI_FILTER_P1FAR3_ADDRESS_UPPER_LSBS_SHIFT (16U)
/*! ADDRESS_UPPER_LSBS - Address Upper LSBs */
#define SPI_FILTER_P1FAR3_ADDRESS_UPPER_LSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P1FAR3_ADDRESS_UPPER_LSBS_SHIFT)) & SPI_FILTER_P1FAR3_ADDRESS_UPPER_LSBS_MASK)

#define SPI_FILTER_P1FAR3_ADDRESS_UPPER_MSBS_MASK (0xFF000000U)
#define SPI_FILTER_P1FAR3_ADDRESS_UPPER_MSBS_SHIFT (24U)
/*! ADDRESS_UPPER_MSBS - Address Upper MSBs */
#define SPI_FILTER_P1FAR3_ADDRESS_UPPER_MSBS(x)  (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_P1FAR3_ADDRESS_UPPER_MSBS_SHIFT)) & SPI_FILTER_P1FAR3_ADDRESS_UPPER_MSBS_MASK)
/*! @} */

/*! @name VER - Version */
/*! @{ */

#define SPI_FILTER_VER_MINOR_REVISION_MASK       (0xF000000U)
#define SPI_FILTER_VER_MINOR_REVISION_SHIFT      (24U)
/*! MINOR_REVISION - Minor revision */
#define SPI_FILTER_VER_MINOR_REVISION(x)         (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_VER_MINOR_REVISION_SHIFT)) & SPI_FILTER_VER_MINOR_REVISION_MASK)

#define SPI_FILTER_VER_MAJOR_REVISION_MASK       (0xF0000000U)
#define SPI_FILTER_VER_MAJOR_REVISION_SHIFT      (28U)
/*! MAJOR_REVISION - Major Revision */
#define SPI_FILTER_VER_MAJOR_REVISION(x)         (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_VER_MAJOR_REVISION_SHIFT)) & SPI_FILTER_VER_MAJOR_REVISION_MASK)
/*! @} */

/*! @name POPCODE0 - Programmable OP-Code0 */
/*! @{ */

#define SPI_FILTER_POPCODE0_FILTER_STATE0_MASK   (0x1F0000U)
#define SPI_FILTER_POPCODE0_FILTER_STATE0_SHIFT  (16U)
/*! FILTER_STATE0 - Programmable Filter state 0 */
#define SPI_FILTER_POPCODE0_FILTER_STATE0(x)     (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE0_FILTER_STATE0_SHIFT)) & SPI_FILTER_POPCODE0_FILTER_STATE0_MASK)

#define SPI_FILTER_POPCODE0_FILTER_BIT0_MASK     (0x200000U)
#define SPI_FILTER_POPCODE0_FILTER_BIT0_SHIFT    (21U)
/*! FILTER_BIT0
 *  0b0..Filter after 7th bit for all Commands Op Codes that need to be filtered.
 *  0b1..Filter after 8th bit for all Read/Write Op Codes that are filtered based on the address.
 */
#define SPI_FILTER_POPCODE0_FILTER_BIT0(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE0_FILTER_BIT0_SHIFT)) & SPI_FILTER_POPCODE0_FILTER_BIT0_MASK)

#define SPI_FILTER_POPCODE0_PRG_OPCODE0_MASK     (0xFF000000U)
#define SPI_FILTER_POPCODE0_PRG_OPCODE0_SHIFT    (24U)
/*! PRG_OPCODE0 - Programmable OP Code 0 */
#define SPI_FILTER_POPCODE0_PRG_OPCODE0(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE0_PRG_OPCODE0_SHIFT)) & SPI_FILTER_POPCODE0_PRG_OPCODE0_MASK)
/*! @} */

/*! @name POPCODE1 - Programmable OP-Code1 */
/*! @{ */

#define SPI_FILTER_POPCODE1_FILTER_STATE1_MASK   (0x1F0000U)
#define SPI_FILTER_POPCODE1_FILTER_STATE1_SHIFT  (16U)
/*! FILTER_STATE1 - Programmable Filter state 1 */
#define SPI_FILTER_POPCODE1_FILTER_STATE1(x)     (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE1_FILTER_STATE1_SHIFT)) & SPI_FILTER_POPCODE1_FILTER_STATE1_MASK)

#define SPI_FILTER_POPCODE1_FILTER_BIT1_MASK     (0x200000U)
#define SPI_FILTER_POPCODE1_FILTER_BIT1_SHIFT    (21U)
/*! FILTER_BIT1
 *  0b0..Filter after 7th bit for all Commands Op Codes that need to be filtered.
 *  0b1..Filter after 8th bit for all Read/Write Op Codes that are filtered based on the address.
 */
#define SPI_FILTER_POPCODE1_FILTER_BIT1(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE1_FILTER_BIT1_SHIFT)) & SPI_FILTER_POPCODE1_FILTER_BIT1_MASK)

#define SPI_FILTER_POPCODE1_PRG_OPCODE1_MASK     (0xFF000000U)
#define SPI_FILTER_POPCODE1_PRG_OPCODE1_SHIFT    (24U)
/*! PRG_OPCODE1 - Programmable OP Code 1 */
#define SPI_FILTER_POPCODE1_PRG_OPCODE1(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE1_PRG_OPCODE1_SHIFT)) & SPI_FILTER_POPCODE1_PRG_OPCODE1_MASK)
/*! @} */

/*! @name POPCODE2 - Programmable OP-Code2 */
/*! @{ */

#define SPI_FILTER_POPCODE2_FILTER_STATE2_MASK   (0x1F0000U)
#define SPI_FILTER_POPCODE2_FILTER_STATE2_SHIFT  (16U)
/*! FILTER_STATE2 - Programmable Filter state 2 */
#define SPI_FILTER_POPCODE2_FILTER_STATE2(x)     (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE2_FILTER_STATE2_SHIFT)) & SPI_FILTER_POPCODE2_FILTER_STATE2_MASK)

#define SPI_FILTER_POPCODE2_FILTER_BIT2_MASK     (0x200000U)
#define SPI_FILTER_POPCODE2_FILTER_BIT2_SHIFT    (21U)
/*! FILTER_BIT2
 *  0b0..Filter after 7th bit for all Commands Op Codes that need to be filtered.
 *  0b1..Filter after 8th bit for all Read/Write Op Codes that are filtered based on the address.
 */
#define SPI_FILTER_POPCODE2_FILTER_BIT2(x)       (((uint32_t)(((uint32_t)(x)) << SPI_FILTER_POPCODE2_FILTER_BIT2_SHIFT)) & SPI_FILTER_POPCODE2_FILTER_BIT2_MASK)

